// 问题答案模板
// @Author: baikai.liao@qq.com
// @2019-07-25

export const answerTemplate = [
    {
      name: '性别',
      options: ['男', '女']
    },
    {
      name: '年龄',
      options: ['18岁以下', '18~25', '26~30', '31~40', '41~50', '51~60', '60以上']
    },
    {
      name: '学历',
      options: ['初中', '高中', '大学专科', '大学本科', '硕士研究生', '博士研究生']
    },
    {
      name: '省份',
      options: ['安徽',
        '北京',
        '重庆',
        '福建',
        '甘肃',
        '广东',
        '广西',
        '贵州',
        '海南',
        '河北',
        '黑龙江',
        '河南',
        '香港',
        '湖北',
        '湖南',
        '江苏',
        '江西',
        '吉林',
        '辽宁',
        '澳门',
        '内蒙古',
        '宁夏',
        '青海',
        '山东',
        '上海',
        '山西',
        '陕西',
        '四川',
        '台湾',
        '天津',
        '新疆',
        '西藏',
        '云南',
        '浙江',
        '海外']
    },
    {
      name: '满意度',
      options: [
        '很不满意',
        '不满意',
        '一般',
        '满意',
        '很满意'
      ]
    },
    {
      name: '认同度',
      options: [
        '很不同意',
        '不同意',
        '一般',
        '同意',
        '很同意'
      ]
    },
    {
      name: '是否',
      options: [
        '是',
        '否'
      ]
    },
    {
      name: '数字',
      options: [
        '0',
        '1',
        '2',
        '3',
        '4',
        '5',
        '6',
        '7',
        '8',
        '9'
      ]
    },
    {
      name: '星期',
      options: [
        '星期日',
        '星期一',
        '星期二',
        '星期三',
        '星期四',
        '星期五',
        '星期六'
      ]
    },
    {
      name: '月份',
      options: [
        '1月份',
        '2月份',
        '3月份',
        '4月份',
        '5月份',
        '6月份',
        '7月份',
        '8月份',
        '9月份',
        '10月份',
        '11月份',
        '12月份'
      ]
    }, {
      name: '年份',
      options: [
        '1980',
        '1981',
        '1982',
        '1983',
        '1984',
        '1985',
        '1986',
        '1987',
        '1988',
        '1989',
        '1990',
        '1991',
        '1992',
        '1993',
        '1994',
        '1995',
        '1996',
        '1997',
        '1998',
        '1999',
        '2000',
        '2001',
        '2002',
        '2003',
        '2004',
        '2005',
        '2006',
        '2007',
        '2008',
        '2009',
        '2010',
        '2011',
        '2012',
        '2013',
        '2014',
        '2015',
        '2016',
        '2017',
        '2018',
        '2019'
      ]
    }
  ];

/**
 * 选项依赖，该选项的出现依赖于pid的那个选项
 * @type {{answer: Array, qid: string}}
 */
export const optionDependent = {
    qid: '', // 题目编号
    answer: null, // 题目选项名称
  };

/**
 * 选项跳转
 * @type {{action: string, qid: string}}
 */
export const optionForward = {
      action: 'next',  // none:无跳转，next：跳转到指定的题目，end：结束
      qid: '', // 跳转题目，只针对于next有效
    };

/**
 * 题目依赖，该题目依赖那个pid的那个选项
 * @type {{answer: null, qid: string}}
 */
export const questionDependent = {
    qid: '', // 题目编号
    answer: null, // 题目选项名称
  };

/**
 * 题目跳转，无条件跳转
 * @type {{}}
 */
export const questionForward = {
    action: 'next',  // none:无跳转，next：跳转到指定的题目，end：结束
    qid: '', // 跳转题目，只针对于next有效
}

export const completionDataTypes = [
  "无",
  "整数",
  "小数",
  "日期",
  "手机",
  "邮件",
  "网址",
  "身份证号",
  "汉字",
  "中文姓名",
  "英文",
  "地址"
];

export const completionDataTypesPlaceHolder = [
  "请输入内容",
  "请输入整数",
  "请输入小数",
  "请输入日期",
  "请输入手机",
  "请输入邮件",
  "请输入网址",
  "请输入身份证号",
  "请输入汉字",
  "请输入中文姓名",
  "请输入英文",
  "请输入地址"
];
